Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83848/dp83848_regs.h
/* Bitfield definition for register: PHYIDR2 */
/*
 * OUI_LSB (RO)
 *
 * OUI Least Significant Bits:
 * Bits 19 to 24 of the OUI (080017h) are mapped from bits 15 to 10 of this register
 * respectively.
 */
#define DP83848_PHYIDR2_OUI_LSB_MASK (0xFC00U)
#define DP83848_PHYIDR2_OUI_LSB_SHIFT (10U)
#define DP83848_PHYIDR2_OUI_LSB_GET(x) (((uint16_t)(x) & DP83848_PHYIDR2_OUI_LSB_MASK) >> DP83848_PHYIDR2_OUI_LSB_SHIFT)

/*
 * VNDR_MDL (RO)
 *
 * Vendor Model Number:
 * The six bits of vendor model number are mapped from bits 9 to 4 (most significant bit to bit
 * 9).
 */
#define DP83848_PHYIDR2_VNDR_MDL_MASK (0x3F0U)
#define DP83848_PHYIDR2_VNDR_MDL_SHIFT (4U)
#define DP83848_PHYIDR2_VNDR_MDL_GET(x) (((uint16_t)(x) & DP83848_PHYIDR2_VNDR_MDL_MASK) >> DP83848_PHYIDR2_VNDR_MDL_SHIFT)

/*
 * MDL_REV (RO)
 *
 * Model Revision Number:
 * Four bits of the vendor model revision number are mapped from bits 3 to 0 (most significant
 * bit to bit 3). This field will be incremented for all major device changes.
 */
#define DP83848_PHYIDR2_MDL_REV_MASK (0xFU)
#define DP83848_PHYIDR2_MDL_REV_SHIFT (0U)
#define DP83848_PHYIDR2_MDL_REV_GET(x) (((uint16_t)(x) & DP83848_PHYIDR2_MDL_REV_MASK) >> DP83848_PHYIDR2_MDL_REV_SHIFT)

/* Bitfield definition for register: ANAR */
/*
 * NP (RW)
 *
 * Next Page Indication:
 * 0 = Next Page Transfer not desired.
 * 1 = Next Page Transfer desired.
 */
#define DP83848_ANAR_NP_MASK (0x8000U)
#define DP83848_ANAR_NP_SHIFT (15U)
#define DP83848_ANAR_NP_SET(x) (((uint16_t)(x) << DP83848_ANAR_NP_SHIFT) & DP83848_ANAR_NP_MASK)
#define DP83848_ANAR_NP_GET(x) (((uint16_t)(x) & DP83848_ANAR_NP_MASK) >> DP83848_ANAR_NP_SHIFT)

/*
 * RF (RW)
 *
 * Remote Fault:
 * 1 = Advertises that this device has detected a Remote Fault.
 * 0 = No Remote Fault detected.
 */
#define DP83848_ANAR_RF_MASK (0x2000U)
#define DP83848_ANAR_RF_SHIFT (13U)
#define DP83848_ANAR_RF_SET(x) (((uint16_t)(x) << DP83848_ANAR_RF_SHIFT) & DP83848_ANAR_RF_MASK)
#define DP83848_ANAR_RF_GET(x) (((uint16_t)(x) & DP83848_ANAR_RF_MASK) >> DP83848_ANAR_RF_SHIFT)

/*
 * ASM_DIR (RW)
 *
 * Asymmetric PAUSE Support for Full Duplex Links:
 * The ASM_DIR bit indicates that asymmetric PAUSE is supported.
 * Encoding and resolution of PAUSE bits is defined in IEEE 802.3 Annex 28B, Tables 28B-2 and
 * 28B-3, respectively. Pause resolution status is reported in PHYCR[13:12].
 * 1 = Advertise that the DTE (MAC) has implemented both the optional MAC control sublayer
 * and the pause function as specified in clause 31 and annex 31B of 802.3.
 * 0= No MAC based full duplex flow control.
 */
#define DP83848_ANAR_ASM_DIR_MASK (0x800U)
#define DP83848_ANAR_ASM_DIR_SHIFT (11U)
#define DP83848_ANAR_ASM_DIR_SET(x) (((uint16_t)(x) << DP83848_ANAR_ASM_DIR_SHIFT) & DP83848_ANAR_ASM_DIR_MASK)
#define DP83848_ANAR_ASM_DIR_GET(x) (((uint16_t)(x) & DP83848_ANAR_ASM_DIR_MASK) >> DP83848_ANAR_ASM_DIR_SHIFT)

/*
 * PAUSE (RW)
 *
 * PAUSE Support for Full Duplex Links:
 * The PAUSE bit indicates that the device is capable of providing the symmetric PAUSE
 * functions as defined in Annex 31B.
 * Encoding and resolution of PAUSE bits is defined in IEEE 802.3 Annex 28B, Tables 28B-2 and
 * 28B-3, respectively. Pause resolution status is reported in PHYCR[13:12].
 * 1 = Advertise that the DTE (MAC) has implemented both the optional MAC control sublayer
 * and the pause function as specified in clause 31 and annex 31B of 802.3.
 * 0= No MAC based full duplex flow control.
 */
#define DP83848_ANAR_PAUSE_MASK (0x400U)
#define DP83848_ANAR_PAUSE_SHIFT (10U)
#define DP83848_ANAR_PAUSE_SET(x) (((uint16_t)(x) << DP83848_ANAR_PAUSE_SHIFT) & DP83848_ANAR_PAUSE_MASK)
#define DP83848_ANAR_PAUSE_GET(x) (((uint16_t)(x) & DP83848_ANAR_PAUSE_MASK) >> DP83848_ANAR_PAUSE_SHIFT)

/*
 * T4 (RO)
 *
 * 100BASE-T4 Support:
 * 1= 100BASE-T4 is supported by the local device.
 * 0 = 100BASE-T4 not supported.
 */
#define DP83848_ANAR_T4_MASK (0x200U)
#define DP83848_ANAR_T4_SHIFT (9U)
#define DP83848_ANAR_T4_GET(x) (((uint16_t)(x) & DP83848_ANAR_T4_MASK) >> DP83848_ANAR_T4_SHIFT)

/*
 * TX_FD (RW)
 *
 * 100BASE-TX Full Duplex Support:
 * 1 = 100BASE-TX Full Duplex is supported by the local device.
 * 0 = 100BASE-TX Full Duplex not supported.
 */
#define DP83848_ANAR_TX_FD_MASK (0x100U)
#define DP83848_ANAR_TX_FD_SHIFT (8U)
#define DP83848_ANAR_TX_FD_SET(x) (((uint16_t)(x) << DP83848_ANAR_TX_FD_SHIFT) & DP83848_ANAR_TX_FD_MASK)
#define DP83848_ANAR_TX_FD_GET(x) (((uint16_t)(x) & DP83848_ANAR_TX_FD_MASK) >> DP83848_ANAR_TX_FD_SHIFT)

/*
 * TX (RW)
 *
 * 100BASE-TX Support:
 * 1 = 100BASE-TX is supported by the local device.
 * 0 = 100BASE-TX not supported.
 */
#define DP83848_ANAR_TX_MASK (0x80U)
#define DP83848_ANAR_TX_SHIFT (7U)
#define DP83848_ANAR_TX_SET(x) (((uint16_t)(x) << DP83848_ANAR_TX_SHIFT) & DP83848_ANAR_TX_MASK)
#define DP83848_ANAR_TX_GET(x) (((uint16_t)(x) & DP83848_ANAR_TX_MASK) >> DP83848_ANAR_TX_SHIFT)

/*
 * 10_FD (RW)
 *
 * 10BASE-T Full Duplex Support:
 * 1 = 10BASE-T Full Duplex is supported by the local device.
 * 0 = 10BASE-T Full Duplex not supported.
 */
#define DP83848_ANAR_10_FD_MASK (0x40U)
#define DP83848_ANAR_10_FD_SHIFT (6U)
#define DP83848_ANAR_10_FD_SET(x) (((uint16_t)(x) << DP83848_ANAR_10_FD_SHIFT) & DP83848_ANAR_10_FD_MASK)
#define DP83848_ANAR_10_FD_GET(x) (((uint16_t)(x) & DP83848_ANAR_10_FD_MASK) >> DP83848_ANAR_10_FD_SHIFT)

/*
 * 10 (RW)
 *
 * 10BASE-T Support:
 * 1 = 10BASE-T is supported by the local device.
 * 0 = 10BASE-T not supported.
 */
#define DP83848_ANAR_10_MASK (0x20U)
#define DP83848_ANAR_10_SHIFT (5U)
#define DP83848_ANAR_10_SET(x) (((uint16_t)(x) << DP83848_ANAR_10_SHIFT) & DP83848_ANAR_10_MASK)
#define DP83848_ANAR_10_GET(x) (((uint16_t)(x) & DP83848_ANAR_10_MASK) >> DP83848_ANAR_10_SHIFT)

/*
 * SELECTOR (RW)
 *
 * Protocol Selection Bits:
 * These bits contain the binary encoded protocol selector supported by this port. <00001>
 * indicates that this device supports IEEE 802.3.
 */
#define DP83848_ANAR_SELECTOR_MASK (0x1FU)
#define DP83848_ANAR_SELECTOR_SHIFT (0U)
#define DP83848_ANAR_SELECTOR_SET(x) (((uint16_t)(x) << DP83848_ANAR_SELECTOR_SHIFT) & DP83848_ANAR_SELECTOR_MASK)
#define DP83848_ANAR_SELECTOR_GET(x) (((uint16_t)(x) & DP83848_ANAR_SELECTOR_MASK) >> DP83848_ANAR_SELECTOR_SHIFT)

/* Bitfield definition for register: ANLPAR_BP */
/*
 * NP (RO)
 *
 * Next Page Indication:
 * 0 = Link Partner does not desire Next Page Transfer.
 * 1 = Link Partner desires Next Page Transfer.
 */
#define DP83848_ANLPAR_BP_NP_MASK (0x8000U)
#define DP83848_ANLPAR_BP_NP_SHIFT (15U)
#define DP83848_ANLPAR_BP_NP_GET(x) (((uint16_t)(x) & DP83848_ANLPAR_BP_NP_MASK) >> DP83848_ANLPAR_BP_NP_SHIFT)

