Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83848/dp83848_regs.h
/*
 * ACK (RO)
 *
 * Acknowledge:
 * 1 = Link Partner acknowledges reception of the ability data word.
 * 0 = Not acknowledged.
 * The Auto-Negotiation state machine will automatically control the this bit based on the incoming
 * FLP bursts.
 */
#define DP83848_ANLPAR_BP_ACK_MASK (0x4000U)
#define DP83848_ANLPAR_BP_ACK_SHIFT (14U)
#define DP83848_ANLPAR_BP_ACK_GET(x) (((uint16_t)(x) & DP83848_ANLPAR_BP_ACK_MASK) >> DP83848_ANLPAR_BP_ACK_SHIFT)

/*
 * RF (RO)
 *
 * Remote Fault:
 * 1 = Remote Fault indicated by Link Partner.
 * 0 = No Remote Fault indicated by Link Partner.
 */
#define DP83848_ANLPAR_BP_RF_MASK (0x2000U)
#define DP83848_ANLPAR_BP_RF_SHIFT (13U)
#define DP83848_ANLPAR_BP_RF_GET(x) (((uint16_t)(x) & DP83848_ANLPAR_BP_RF_MASK) >> DP83848_ANLPAR_BP_RF_SHIFT)

/*
 * ASM_DIR (RO)
 *
 * ASYMMETRIC PAUSE:
 * 1 = Asymmetric pause is supported by the Link Partner.
 * 0 = Asymmetric pause is not supported by the Link Partner.
 */
#define DP83848_ANLPAR_BP_ASM_DIR_MASK (0x800U)
#define DP83848_ANLPAR_BP_ASM_DIR_SHIFT (11U)
#define DP83848_ANLPAR_BP_ASM_DIR_GET(x) (((uint16_t)(x) & DP83848_ANLPAR_BP_ASM_DIR_MASK) >> DP83848_ANLPAR_BP_ASM_DIR_SHIFT)

/*
 * PAUSE (RO)
 *
 * PAUSE:
 * 1 = Pause function is supported by the Link Partner.
 * 0 = Pause function is not supported by the Link Partner.
 */
#define DP83848_ANLPAR_BP_PAUSE_MASK (0x400U)
#define DP83848_ANLPAR_BP_PAUSE_SHIFT (10U)
#define DP83848_ANLPAR_BP_PAUSE_GET(x) (((uint16_t)(x) & DP83848_ANLPAR_BP_PAUSE_MASK) >> DP83848_ANLPAR_BP_PAUSE_SHIFT)

/*
 * T4 (RO)
 *
 * 100BASE-T4 Support:
 * 1 = 100BASE-T4 is supported by the Link Partner.
 * 0 = 100BASE-T4 not supported by the Link Partner.
 */
#define DP83848_ANLPAR_BP_T4_MASK (0x200U)
#define DP83848_ANLPAR_BP_T4_SHIFT (9U)
#define DP83848_ANLPAR_BP_T4_GET(x) (((uint16_t)(x) & DP83848_ANLPAR_BP_T4_MASK) >> DP83848_ANLPAR_BP_T4_SHIFT)

/*
 * TX_FD (RO)
 *
 * 100BASE-TX Full Duplex Support:
 * 1 = 100BASE-TX Full Duplex is supported by the Link Partner.
 * 0 = 100BASE-TX Full Duplex not supported by the Link Partner.
 */
#define DP83848_ANLPAR_BP_TX_FD_MASK (0x100U)
#define DP83848_ANLPAR_BP_TX_FD_SHIFT (8U)
#define DP83848_ANLPAR_BP_TX_FD_GET(x) (((uint16_t)(x) & DP83848_ANLPAR_BP_TX_FD_MASK) >> DP83848_ANLPAR_BP_TX_FD_SHIFT)

/*
 * TX (RO)
 *
 * 100BASE-TX Support:
 * 1 = 100BASE-TX is supported by the Link Partner.
 * 0 = 100BASE-TX not supported by the Link Partner.
 */
#define DP83848_ANLPAR_BP_TX_MASK (0x80U)
#define DP83848_ANLPAR_BP_TX_SHIFT (7U)
#define DP83848_ANLPAR_BP_TX_GET(x) (((uint16_t)(x) & DP83848_ANLPAR_BP_TX_MASK) >> DP83848_ANLPAR_BP_TX_SHIFT)

/*
 * 10_FD (RO)
 *
 * 10BASE-T Full Duplex Support:
 * 1 = 10BASE-T Full Duplex is supported by the Link Partner.
 * 0 = 10BASE-T Full Duplex not supported by the Link Partner.
 */
#define DP83848_ANLPAR_BP_10_FD_MASK (0x40U)
#define DP83848_ANLPAR_BP_10_FD_SHIFT (6U)
#define DP83848_ANLPAR_BP_10_FD_GET(x) (((uint16_t)(x) & DP83848_ANLPAR_BP_10_FD_MASK) >> DP83848_ANLPAR_BP_10_FD_SHIFT)

/*
 * 10 (RO)
 *
 * 10BASE-T Support:
 * 1 = 10BASE-T is supported by the Link Partner.
 * 0 = 10BASE-T not supported by the Link Partner.
 */
#define DP83848_ANLPAR_BP_10_MASK (0x20U)
#define DP83848_ANLPAR_BP_10_SHIFT (5U)
#define DP83848_ANLPAR_BP_10_GET(x) (((uint16_t)(x) & DP83848_ANLPAR_BP_10_MASK) >> DP83848_ANLPAR_BP_10_SHIFT)

/*
 * SELECTOR (RO)
 *
 * Protocol Selection Bits:
 * Link Partner’s binary encoded protocol selector.
 */
#define DP83848_ANLPAR_BP_SELECTOR_MASK (0x1FU)
#define DP83848_ANLPAR_BP_SELECTOR_SHIFT (0U)
#define DP83848_ANLPAR_BP_SELECTOR_GET(x) (((uint16_t)(x) & DP83848_ANLPAR_BP_SELECTOR_MASK) >> DP83848_ANLPAR_BP_SELECTOR_SHIFT)

/* Bitfield definition for register: ANER */
/*
 * PDF (RO)
 *
 * Parallel Detection Fault:
 * 1 = A fault has been detected through the Parallel Detection function.
 * 0 = A fault has not been detected.
 */
#define DP83848_ANER_PDF_MASK (0x10U)
#define DP83848_ANER_PDF_SHIFT (4U)
#define DP83848_ANER_PDF_GET(x) (((uint16_t)(x) & DP83848_ANER_PDF_MASK) >> DP83848_ANER_PDF_SHIFT)

/*
 * LP_NP_ABLE (RO)
 *
 * Link Partner Next Page Able:
 * 1 = Link Partner does support Next Page.
 * 0 = Link Partner does not support Next Page.
 */
#define DP83848_ANER_LP_NP_ABLE_MASK (0x8U)
#define DP83848_ANER_LP_NP_ABLE_SHIFT (3U)
#define DP83848_ANER_LP_NP_ABLE_GET(x) (((uint16_t)(x) & DP83848_ANER_LP_NP_ABLE_MASK) >> DP83848_ANER_LP_NP_ABLE_SHIFT)

/*
 * NP_ABLE (RO)
 *
 * Next Page Able:
 * 1 = Indicates local device is able to send additional “Next Pages”.
 */
#define DP83848_ANER_NP_ABLE_MASK (0x4U)
#define DP83848_ANER_NP_ABLE_SHIFT (2U)
#define DP83848_ANER_NP_ABLE_GET(x) (((uint16_t)(x) & DP83848_ANER_NP_ABLE_MASK) >> DP83848_ANER_NP_ABLE_SHIFT)

/*
 * PAGE_RX (RO)
 *
 * Link Code Word Page Received:
 * 1 = Link Code Word has been received, cleared on a read.
 * 0 = Link Code Word has not been received.
 */
#define DP83848_ANER_PAGE_RX_MASK (0x2U)
#define DP83848_ANER_PAGE_RX_SHIFT (1U)
#define DP83848_ANER_PAGE_RX_GET(x) (((uint16_t)(x) & DP83848_ANER_PAGE_RX_MASK) >> DP83848_ANER_PAGE_RX_SHIFT)

/*
 * LP_AN_ABLE (RO)
 *
 * Link Partner Auto-Negotiation Able:
 * 1 = indicates that the Link Partner supports Auto-Negotiation.
 * 0 = indicates that the Link Partner does not support Auto-Negotiation.
 */
#define DP83848_ANER_LP_AN_ABLE_MASK (0x1U)
#define DP83848_ANER_LP_AN_ABLE_SHIFT (0U)
#define DP83848_ANER_LP_AN_ABLE_GET(x) (((uint16_t)(x) & DP83848_ANER_LP_AN_ABLE_MASK) >> DP83848_ANER_LP_AN_ABLE_SHIFT)

/* Bitfield definition for register: ANNPTR */
/*
 * NP (RW)
 *
 * Next Page Indication:
 * 0 = No other Next Page Transfer desired.
 * 1 = Another Next Page desired.
 */
#define DP83848_ANNPTR_NP_MASK (0x8000U)
#define DP83848_ANNPTR_NP_SHIFT (15U)
#define DP83848_ANNPTR_NP_SET(x) (((uint16_t)(x) << DP83848_ANNPTR_NP_SHIFT) & DP83848_ANNPTR_NP_MASK)
#define DP83848_ANNPTR_NP_GET(x) (((uint16_t)(x) & DP83848_ANNPTR_NP_MASK) >> DP83848_ANNPTR_NP_SHIFT)

/*
 * MP (RW)
 *
 * Message Page:
 * 1 = Message Page.
 * 0 = Unformatted Page.
 */
#define DP83848_ANNPTR_MP_MASK (0x2000U)
#define DP83848_ANNPTR_MP_SHIFT (13U)
#define DP83848_ANNPTR_MP_SET(x) (((uint16_t)(x) << DP83848_ANNPTR_MP_SHIFT) & DP83848_ANNPTR_MP_MASK)
#define DP83848_ANNPTR_MP_GET(x) (((uint16_t)(x) & DP83848_ANNPTR_MP_MASK) >> DP83848_ANNPTR_MP_SHIFT)

