Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83848/dp83848_regs.h
/*
 * JABBER_DETECT (RO)
 *
 * Jabber Detect: This bit only has meaning in 10 Mb/s mode
 * This bit is a duplicate of the Jabber Detect bit in the BMSR register, except that it is not
 * cleared upon a read of the PHYSTS register.
 * 1 = Jabber condition detected.
 * 0 = No Jabber.
 */
#define DP83848_PHYSTS_JABBER_DETECT_MASK (0x20U)
#define DP83848_PHYSTS_JABBER_DETECT_SHIFT (5U)
#define DP83848_PHYSTS_JABBER_DETECT_GET(x) (((uint16_t)(x) & DP83848_PHYSTS_JABBER_DETECT_MASK) >> DP83848_PHYSTS_JABBER_DETECT_SHIFT)

/*
 * AUTO_NEG_COMPLETE (RO)
 *
 * Auto-Negotiation Complete:
 * 1 = Auto-Negotiation complete.
 * 0 = Auto-Negotiation not complete.
 */
#define DP83848_PHYSTS_AUTO_NEG_COMPLETE_MASK (0x10U)
#define DP83848_PHYSTS_AUTO_NEG_COMPLETE_SHIFT (4U)
#define DP83848_PHYSTS_AUTO_NEG_COMPLETE_GET(x) (((uint16_t)(x) & DP83848_PHYSTS_AUTO_NEG_COMPLETE_MASK) >> DP83848_PHYSTS_AUTO_NEG_COMPLETE_SHIFT)

/*
 * LOOPBACK_STATUS (RO)
 *
 * Loopback:
 * 1 = Loopback enabled.
 * 0 = Normal operation.
 */
#define DP83848_PHYSTS_LOOPBACK_STATUS_MASK (0x8U)
#define DP83848_PHYSTS_LOOPBACK_STATUS_SHIFT (3U)
#define DP83848_PHYSTS_LOOPBACK_STATUS_GET(x) (((uint16_t)(x) & DP83848_PHYSTS_LOOPBACK_STATUS_MASK) >> DP83848_PHYSTS_LOOPBACK_STATUS_SHIFT)

/*
 * DUPLEX_STATUS (RO)
 *
 * Duplex:
 * This bit indicates duplex status and is determined from Auto-Negotiation or Forced Modes.
 * 1 = Full duplex mode.
 * 0 = Half duplex mode.
 * Note: This bit is only valid if Auto-Negotiation is enabled and complete and there is a valid
 * link or if Auto-Negotiation is disabled and there is a valid link.
 */
#define DP83848_PHYSTS_DUPLEX_STATUS_MASK (0x4U)
#define DP83848_PHYSTS_DUPLEX_STATUS_SHIFT (2U)
#define DP83848_PHYSTS_DUPLEX_STATUS_GET(x) (((uint16_t)(x) & DP83848_PHYSTS_DUPLEX_STATUS_MASK) >> DP83848_PHYSTS_DUPLEX_STATUS_SHIFT)

/*
 * SPEED_STATUS (RO)
 *
 * Speed10:
 * This bit indicates the status of the speed and is determined from Auto-Negotiation or Forced
 * Modes.
 * 1 = 10 Mb/s mode.
 * 0 = 100 Mb/s mode.
 * Note: This bit is only valid if Auto-Negotiation is enabled and complete and there is a valid
 * link or if Auto-Negotiation is disabled and there is a valid link.
 */
#define DP83848_PHYSTS_SPEED_STATUS_MASK (0x2U)
#define DP83848_PHYSTS_SPEED_STATUS_SHIFT (1U)
#define DP83848_PHYSTS_SPEED_STATUS_GET(x) (((uint16_t)(x) & DP83848_PHYSTS_SPEED_STATUS_MASK) >> DP83848_PHYSTS_SPEED_STATUS_SHIFT)

/*
 * LINK_STATUS (RO)
 *
 * Link Status:
 * This bit is a duplicate of the Link Status bit in the BMSR register, except that it will not be
 * cleared upon a read of the PHYSTS register.
 * 1 = Valid link established (for either 10 or 100 Mb/s operation)
 * 0 = Link not established.
 */
#define DP83848_PHYSTS_LINK_STATUS_MASK (0x1U)
#define DP83848_PHYSTS_LINK_STATUS_SHIFT (0U)
#define DP83848_PHYSTS_LINK_STATUS_GET(x) (((uint16_t)(x) & DP83848_PHYSTS_LINK_STATUS_MASK) >> DP83848_PHYSTS_LINK_STATUS_SHIFT)

/* Bitfield definition for register: FCSCR */
/*
 * FCSCNT_7_0 (RO)
 *
 * False Carrier Event Counter:
 * This 8-bit counter increments on every false carrier event. This counter sticks when it
 * reaches its max count (FFh).
 */
#define DP83848_FCSCR_FCSCNT_7_0_MASK (0xFFU)
#define DP83848_FCSCR_FCSCNT_7_0_SHIFT (0U)
#define DP83848_FCSCR_FCSCNT_7_0_GET(x) (((uint16_t)(x) & DP83848_FCSCR_FCSCNT_7_0_MASK) >> DP83848_FCSCR_FCSCNT_7_0_SHIFT)

/* Bitfield definition for register: RECR */
/*
 * RXERCNT_7_0 (RO)
 *
 * RX_ER Counter:
 * When a valid carrier is present and there is at least one occurrence of an invalid data
 * symbol, this 8-bit counter increments for each receive error detected. This event can
 * increment only once per valid carrier event. If a collision is present, the attribute will not
 * increment. The counter sticks when it reaches its max count.
 */
#define DP83848_RECR_RXERCNT_7_0_MASK (0xFFU)
#define DP83848_RECR_RXERCNT_7_0_SHIFT (0U)
#define DP83848_RECR_RXERCNT_7_0_GET(x) (((uint16_t)(x) & DP83848_RECR_RXERCNT_7_0_MASK) >> DP83848_RECR_RXERCNT_7_0_SHIFT)

/* Bitfield definition for register: PCSR */
/*
 * TQ_EN (RW)
 *
 * 100Mbs True Quiet Mode Enable:
 * 1 = Transmit True Quiet Mode.
 * 0 = Normal Transmit Mode.
 */
#define DP83848_PCSR_TQ_EN_MASK (0x400U)
#define DP83848_PCSR_TQ_EN_SHIFT (10U)
#define DP83848_PCSR_TQ_EN_SET(x) (((uint16_t)(x) << DP83848_PCSR_TQ_EN_SHIFT) & DP83848_PCSR_TQ_EN_MASK)
#define DP83848_PCSR_TQ_EN_GET(x) (((uint16_t)(x) & DP83848_PCSR_TQ_EN_MASK) >> DP83848_PCSR_TQ_EN_SHIFT)

/*
 * SD_FORCE_PMA (RW)
 *
 * Signal Detect Force PMA:
 * 1 = Forces Signal Detection in PMA.
 * 0 = Normal SD operation.
 */
#define DP83848_PCSR_SD_FORCE_PMA_MASK (0x200U)
#define DP83848_PCSR_SD_FORCE_PMA_SHIFT (9U)
#define DP83848_PCSR_SD_FORCE_PMA_SET(x) (((uint16_t)(x) << DP83848_PCSR_SD_FORCE_PMA_SHIFT) & DP83848_PCSR_SD_FORCE_PMA_MASK)
#define DP83848_PCSR_SD_FORCE_PMA_GET(x) (((uint16_t)(x) & DP83848_PCSR_SD_FORCE_PMA_MASK) >> DP83848_PCSR_SD_FORCE_PMA_SHIFT)

/*
 * SD_OPTION (RW)
 *
 * Signal Detect Option:
 * 1 = Enhanced signal detect algorithm.
 * 0 = Reduced signal detect algorithm.
 */
#define DP83848_PCSR_SD_OPTION_MASK (0x100U)
#define DP83848_PCSR_SD_OPTION_SHIFT (8U)
#define DP83848_PCSR_SD_OPTION_SET(x) (((uint16_t)(x) << DP83848_PCSR_SD_OPTION_SHIFT) & DP83848_PCSR_SD_OPTION_MASK)
#define DP83848_PCSR_SD_OPTION_GET(x) (((uint16_t)(x) & DP83848_PCSR_SD_OPTION_MASK) >> DP83848_PCSR_SD_OPTION_SHIFT)

/*
 * DESC_TIME (RW)
 *
 * Descrambler Timeout:
 * Increase the descrambler timeout. When set this should allow the device to receive larger
 * packets (>9k bytes) without loss of synchronization.
 * 1 = 2ms
 * 0 = 722us (per ANSI X3.263: 1995 (TP-PMD) 7.2.3.3e)
 */
#define DP83848_PCSR_DESC_TIME_MASK (0x80U)
#define DP83848_PCSR_DESC_TIME_SHIFT (7U)
#define DP83848_PCSR_DESC_TIME_SET(x) (((uint16_t)(x) << DP83848_PCSR_DESC_TIME_SHIFT) & DP83848_PCSR_DESC_TIME_MASK)
#define DP83848_PCSR_DESC_TIME_GET(x) (((uint16_t)(x) & DP83848_PCSR_DESC_TIME_MASK) >> DP83848_PCSR_DESC_TIME_SHIFT)

