Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83848/dp83848_regs.h
/*
 * FORCE_MDIX (RW)
 *
 * Force MDIX:
 * 1 = Force MDI pairs to cross. (Receive on TPTD pair, Transmit on TPRD pair)
 * 0 = Normal operation.
 */
#define DP83848_PHYCR_FORCE_MDIX_MASK (0x4000U)
#define DP83848_PHYCR_FORCE_MDIX_SHIFT (14U)
#define DP83848_PHYCR_FORCE_MDIX_SET(x) (((uint16_t)(x) << DP83848_PHYCR_FORCE_MDIX_SHIFT) & DP83848_PHYCR_FORCE_MDIX_MASK)
#define DP83848_PHYCR_FORCE_MDIX_GET(x) (((uint16_t)(x) & DP83848_PHYCR_FORCE_MDIX_MASK) >> DP83848_PHYCR_FORCE_MDIX_SHIFT)

/*
 * PAUSE_RX (RO)
 *
 * Pause Receive Negotiated:
 * Indicates that pause receive should be enabled in the MAC. Based on ANAR[11:10] and
 * ANLPAR[11:10] settings.
 * This function shall be enabled according to IEEE 802.3 Annex 28B Table 28B-3, “Pause
 * Resolution”, only if the Auto-Negotiated Highest Common Denominator is a full duplex
 * technology.
 */
#define DP83848_PHYCR_PAUSE_RX_MASK (0x2000U)
#define DP83848_PHYCR_PAUSE_RX_SHIFT (13U)
#define DP83848_PHYCR_PAUSE_RX_GET(x) (((uint16_t)(x) & DP83848_PHYCR_PAUSE_RX_MASK) >> DP83848_PHYCR_PAUSE_RX_SHIFT)

/*
 * PAUSE_TX (RO)
 *
 * Pause Transmit Negotiated:
 * Indicates that pause transmit should be enabled in the MAC. Based on ANAR[11:10] and
 * ANLPAR[11:10] settings.
 * This function shall be enabled according to IEEE 802.3 Annex 28B Table 28B-3, “Pause
 * Resolution”, only if the Auto-Negotiated Highest Common Denominator is a full duplex
 * technology.
 */
#define DP83848_PHYCR_PAUSE_TX_MASK (0x1000U)
#define DP83848_PHYCR_PAUSE_TX_SHIFT (12U)
#define DP83848_PHYCR_PAUSE_TX_GET(x) (((uint16_t)(x) & DP83848_PHYCR_PAUSE_TX_MASK) >> DP83848_PHYCR_PAUSE_TX_SHIFT)

/*
 * BIST_FE (RW)
 *
 * BIST Force Error:
 * 1 = Force BIST Error.
 * 0 = Normal operation.
 * This bit forces a single error, and is self clearing.
 */
#define DP83848_PHYCR_BIST_FE_MASK (0x800U)
#define DP83848_PHYCR_BIST_FE_SHIFT (11U)
#define DP83848_PHYCR_BIST_FE_SET(x) (((uint16_t)(x) << DP83848_PHYCR_BIST_FE_SHIFT) & DP83848_PHYCR_BIST_FE_MASK)
#define DP83848_PHYCR_BIST_FE_GET(x) (((uint16_t)(x) & DP83848_PHYCR_BIST_FE_MASK) >> DP83848_PHYCR_BIST_FE_SHIFT)

/*
 * PSR_15 (RW)
 *
 * BIST Sequence select:
 * 1 = PSR15 selected.
 * 0 = PSR9 selected.
 */
#define DP83848_PHYCR_PSR_15_MASK (0x400U)
#define DP83848_PHYCR_PSR_15_SHIFT (10U)
#define DP83848_PHYCR_PSR_15_SET(x) (((uint16_t)(x) << DP83848_PHYCR_PSR_15_SHIFT) & DP83848_PHYCR_PSR_15_MASK)
#define DP83848_PHYCR_PSR_15_GET(x) (((uint16_t)(x) & DP83848_PHYCR_PSR_15_MASK) >> DP83848_PHYCR_PSR_15_SHIFT)

/*
 * BIST_STATUS (RO)
 *
 * BIST Test Status:
 * 1 = BIST pass.
 * 0 = BIST fail. Latched, cleared when BIST is stopped.
 * For a count number of BIST errors, see the BIST Error Count in the CDCTRL1 register.
 */
#define DP83848_PHYCR_BIST_STATUS_MASK (0x200U)
#define DP83848_PHYCR_BIST_STATUS_SHIFT (9U)
#define DP83848_PHYCR_BIST_STATUS_GET(x) (((uint16_t)(x) & DP83848_PHYCR_BIST_STATUS_MASK) >> DP83848_PHYCR_BIST_STATUS_SHIFT)

/*
 * BIST_START (RW)
 *
 * BIST Start:
 * 1 = BIST start.
 * 0 = BIST stop.
 */
#define DP83848_PHYCR_BIST_START_MASK (0x100U)
#define DP83848_PHYCR_BIST_START_SHIFT (8U)
#define DP83848_PHYCR_BIST_START_SET(x) (((uint16_t)(x) << DP83848_PHYCR_BIST_START_SHIFT) & DP83848_PHYCR_BIST_START_MASK)
#define DP83848_PHYCR_BIST_START_GET(x) (((uint16_t)(x) & DP83848_PHYCR_BIST_START_MASK) >> DP83848_PHYCR_BIST_START_SHIFT)

/*
 * BP_STRETCH (RW)
 *
 * Bypass LED Stretching:
 * This will bypass the LED stretching and the LEDs will reflect the internal value.
 * 1 = Bypass LED stretching.
 * 0 = Normal operation.
 */
#define DP83848_PHYCR_BP_STRETCH_MASK (0x80U)
#define DP83848_PHYCR_BP_STRETCH_SHIFT (7U)
#define DP83848_PHYCR_BP_STRETCH_SET(x) (((uint16_t)(x) << DP83848_PHYCR_BP_STRETCH_SHIFT) & DP83848_PHYCR_BP_STRETCH_MASK)
#define DP83848_PHYCR_BP_STRETCH_GET(x) (((uint16_t)(x) & DP83848_PHYCR_BP_STRETCH_MASK) >> DP83848_PHYCR_BP_STRETCH_SHIFT)

/*
 * LED_CNFG_0 (RW)
 *
 * LED Configuration
 * LED_ CNFG[0] Mode Description
 * 1 Mode 1
 * 0 Mode2
 * In Mode 1, LEDs are configured as follows: LED_LINK = ON for Good Link, OFF for No Link
 * LED_SPEED = ON in 100Mb/s, OFF in 10Mb/s
 * In Mode 2, LEDs are configured as follows: LED_LINK = ON for good Link, BLINK for Activity
 * LED_SPEED = ON in 100Mb/s, OFF in 10Mb/s
 */
#define DP83848_PHYCR_LED_CNFG_0_MASK (0x20U)
#define DP83848_PHYCR_LED_CNFG_0_SHIFT (5U)
#define DP83848_PHYCR_LED_CNFG_0_SET(x) (((uint16_t)(x) << DP83848_PHYCR_LED_CNFG_0_SHIFT) & DP83848_PHYCR_LED_CNFG_0_MASK)
#define DP83848_PHYCR_LED_CNFG_0_GET(x) (((uint16_t)(x) & DP83848_PHYCR_LED_CNFG_0_MASK) >> DP83848_PHYCR_LED_CNFG_0_SHIFT)

/*
 * PHYADDR_4_0 (RW)
 *
 * PHY Address: PHY address for port.
 */
#define DP83848_PHYCR_PHYADDR_4_0_MASK (0x1FU)
#define DP83848_PHYCR_PHYADDR_4_0_SHIFT (0U)
#define DP83848_PHYCR_PHYADDR_4_0_SET(x) (((uint16_t)(x) << DP83848_PHYCR_PHYADDR_4_0_SHIFT) & DP83848_PHYCR_PHYADDR_4_0_MASK)
#define DP83848_PHYCR_PHYADDR_4_0_GET(x) (((uint16_t)(x) & DP83848_PHYCR_PHYADDR_4_0_MASK) >> DP83848_PHYCR_PHYADDR_4_0_SHIFT)

/* Bitfield definition for register: 10BTSCR */
/*
 * SQUELCH (RW)
 *
 * Squelch Configuration:
 * Used to set the Squelch ‘ON’ threshold for the receiver.
 * Default Squelch ON is 330-mV peak.
 */
#define DP83848_10BTSCR_SQUELCH_MASK (0xE00U)
#define DP83848_10BTSCR_SQUELCH_SHIFT (9U)
#define DP83848_10BTSCR_SQUELCH_SET(x) (((uint16_t)(x) << DP83848_10BTSCR_SQUELCH_SHIFT) & DP83848_10BTSCR_SQUELCH_MASK)
#define DP83848_10BTSCR_SQUELCH_GET(x) (((uint16_t)(x) & DP83848_10BTSCR_SQUELCH_MASK) >> DP83848_10BTSCR_SQUELCH_SHIFT)

/*
 * LOOPBACK_10_DIS (RW)
 *
 * In half-duplex mode, default 10BASE-T operation loops Transmit data to the Receive data
 * in addition to transmitting the data on the physical medium. This is for consistency with
 * earlier 10BASE2 and 10BASE5 implementations which used a shared medium. Setting
 * this bit disables the loopback function.
 * This bit does not affect loopback due to setting BMCR[14].
 */
#define DP83848_10BTSCR_LOOPBACK_10_DIS_MASK (0x100U)
#define DP83848_10BTSCR_LOOPBACK_10_DIS_SHIFT (8U)
#define DP83848_10BTSCR_LOOPBACK_10_DIS_SET(x) (((uint16_t)(x) << DP83848_10BTSCR_LOOPBACK_10_DIS_SHIFT) & DP83848_10BTSCR_LOOPBACK_10_DIS_MASK)
#define DP83848_10BTSCR_LOOPBACK_10_DIS_GET(x) (((uint16_t)(x) & DP83848_10BTSCR_LOOPBACK_10_DIS_MASK) >> DP83848_10BTSCR_LOOPBACK_10_DIS_SHIFT)

