Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83848/dp83848_regs.h
/*
 * LP_DIS (RW)
 *
 * Normal Link Pulse Disable:
 * 1 = Transmission of NLPs is disabled.
 * 0 = Transmission of NLPs is enabled.
 */
#define DP83848_10BTSCR_LP_DIS_MASK (0x80U)
#define DP83848_10BTSCR_LP_DIS_SHIFT (7U)
#define DP83848_10BTSCR_LP_DIS_SET(x) (((uint16_t)(x) << DP83848_10BTSCR_LP_DIS_SHIFT) & DP83848_10BTSCR_LP_DIS_MASK)
#define DP83848_10BTSCR_LP_DIS_GET(x) (((uint16_t)(x) & DP83848_10BTSCR_LP_DIS_MASK) >> DP83848_10BTSCR_LP_DIS_SHIFT)

/*
 * FORCE_LINK_10 (RW)
 *
 * Force 10Mb Good Link:
 * 1 = Forced Good 10 Mb Link.
 * 0 = Normal Link Status.
 */
#define DP83848_10BTSCR_FORCE_LINK_10_MASK (0x40U)
#define DP83848_10BTSCR_FORCE_LINK_10_SHIFT (6U)
#define DP83848_10BTSCR_FORCE_LINK_10_SET(x) (((uint16_t)(x) << DP83848_10BTSCR_FORCE_LINK_10_SHIFT) & DP83848_10BTSCR_FORCE_LINK_10_MASK)
#define DP83848_10BTSCR_FORCE_LINK_10_GET(x) (((uint16_t)(x) & DP83848_10BTSCR_FORCE_LINK_10_MASK) >> DP83848_10BTSCR_FORCE_LINK_10_SHIFT)

/*
 * POLARITY (RO)
 *
 * 10Mb Polarity Status:
 * This bit is a duplication of bit 12 in the PHYSTS register. Both bits will be cleared upon a
 * read of 10BTSCR register, but not upon a read of the PHYSTS register.
 * 1 = Inverted Polarity detected.
 * 0 = Correct Polarity detected.
 */
#define DP83848_10BTSCR_POLARITY_MASK (0x10U)
#define DP83848_10BTSCR_POLARITY_SHIFT (4U)
#define DP83848_10BTSCR_POLARITY_GET(x) (((uint16_t)(x) & DP83848_10BTSCR_POLARITY_MASK) >> DP83848_10BTSCR_POLARITY_SHIFT)

/*
 * HEARTBEAT_DIS (RW)
 *
 * Heartbeat Disable: This bit only has influence in half-duplex 10Mb mode.
 * 1 = Heartbeat function disabled.
 * 0 = Heartbeat function enabled.
 * When the device is operating at 100 Mb or configured for full duplex operation, this
 * bit will be ignored - the heartbeat function is disabled.
 */
#define DP83848_10BTSCR_HEARTBEAT_DIS_MASK (0x2U)
#define DP83848_10BTSCR_HEARTBEAT_DIS_SHIFT (1U)
#define DP83848_10BTSCR_HEARTBEAT_DIS_SET(x) (((uint16_t)(x) << DP83848_10BTSCR_HEARTBEAT_DIS_SHIFT) & DP83848_10BTSCR_HEARTBEAT_DIS_MASK)
#define DP83848_10BTSCR_HEARTBEAT_DIS_GET(x) (((uint16_t)(x) & DP83848_10BTSCR_HEARTBEAT_DIS_MASK) >> DP83848_10BTSCR_HEARTBEAT_DIS_SHIFT)

/*
 * JABBER_DIS (RW)
 *
 * Jabber Disable:
 * Applicable only in 10BASE-T.
 * 1 = Jabber function disabled.
 * 0 = Jabber function enabled.
 */
#define DP83848_10BTSCR_JABBER_DIS_MASK (0x1U)
#define DP83848_10BTSCR_JABBER_DIS_SHIFT (0U)
#define DP83848_10BTSCR_JABBER_DIS_SET(x) (((uint16_t)(x) << DP83848_10BTSCR_JABBER_DIS_SHIFT) & DP83848_10BTSCR_JABBER_DIS_MASK)
#define DP83848_10BTSCR_JABBER_DIS_GET(x) (((uint16_t)(x) & DP83848_10BTSCR_JABBER_DIS_MASK) >> DP83848_10BTSCR_JABBER_DIS_SHIFT)

/* Bitfield definition for register: CDCTRL1 */
/*
 * BIST_ERROR_COUNT (RO)
 *
 * BIST ERROR Counter:
 * Counts number of errored data nibbles during Packet BIST. This value will reset when
 * Packet BIST is restarted. The counter sticks when it reaches its max count.
 */
#define DP83848_CDCTRL1_BIST_ERROR_COUNT_MASK (0xFF00U)
#define DP83848_CDCTRL1_BIST_ERROR_COUNT_SHIFT (8U)
#define DP83848_CDCTRL1_BIST_ERROR_COUNT_GET(x) (((uint16_t)(x) & DP83848_CDCTRL1_BIST_ERROR_COUNT_MASK) >> DP83848_CDCTRL1_BIST_ERROR_COUNT_SHIFT)

/*
 * BIST_CONT_MODE (RW)
 *
 * Packet BIST Continuous Mode:
 * Allows continuous pseudo random data transmission without any break in transmission. This
 * can be used for transmit VOD testing. This is used in conjunction with the BIST controls in
 * the PHYCR Register (0x19h). For 10 Mb operation, jabber function must be disabled, bit 0 of
 * the 10BTSCR (0x1Ah), JABBER_DIS = 1.
 */
#define DP83848_CDCTRL1_BIST_CONT_MODE_MASK (0x20U)
#define DP83848_CDCTRL1_BIST_CONT_MODE_SHIFT (5U)
#define DP83848_CDCTRL1_BIST_CONT_MODE_SET(x) (((uint16_t)(x) << DP83848_CDCTRL1_BIST_CONT_MODE_SHIFT) & DP83848_CDCTRL1_BIST_CONT_MODE_MASK)
#define DP83848_CDCTRL1_BIST_CONT_MODE_GET(x) (((uint16_t)(x) & DP83848_CDCTRL1_BIST_CONT_MODE_MASK) >> DP83848_CDCTRL1_BIST_CONT_MODE_SHIFT)

/*
 * CDPATTEN_10 (RW)
 *
 * CD Pattern Enable for 10Mb:
 * 1 = Enabled.
 * 0 = Disabled.
 */
#define DP83848_CDCTRL1_CDPATTEN_10_MASK (0x10U)
#define DP83848_CDCTRL1_CDPATTEN_10_SHIFT (4U)
#define DP83848_CDCTRL1_CDPATTEN_10_SET(x) (((uint16_t)(x) << DP83848_CDCTRL1_CDPATTEN_10_SHIFT) & DP83848_CDCTRL1_CDPATTEN_10_MASK)
#define DP83848_CDCTRL1_CDPATTEN_10_GET(x) (((uint16_t)(x) & DP83848_CDCTRL1_CDPATTEN_10_MASK) >> DP83848_CDCTRL1_CDPATTEN_10_SHIFT)

/*
 * 10MEG_PATT_GAP ( RW)
 *
 * Defines gap between data or NLP test sequences:
 * 1 = 15 µs.
 * 0 = 10 µs.
 */
#define DP83848_CDCTRL1_10MEG_PATT_GAP_MASK (0x4U)
#define DP83848_CDCTRL1_10MEG_PATT_GAP_SHIFT (2U)
#define DP83848_CDCTRL1_10MEG_PATT_GAP_SET(x) (((uint16_t)(x) << DP83848_CDCTRL1_10MEG_PATT_GAP_SHIFT) & DP83848_CDCTRL1_10MEG_PATT_GAP_MASK)
#define DP83848_CDCTRL1_10MEG_PATT_GAP_GET(x) (((uint16_t)(x) & DP83848_CDCTRL1_10MEG_PATT_GAP_MASK) >> DP83848_CDCTRL1_10MEG_PATT_GAP_SHIFT)

/*
 * CDPATTSEL_1_0 (RW)
 *
 * CD Pattern Select[1:0]:
 * If CDPATTEN_10 = 1:
 * 00 = Data, EOP0 sequence
 * 01 = Data, EOP1 sequence
 * 10 = NLPs
 * 11 = Constant Manchester 1 s (10-MHz sine wave) for harmonic distortion testing.
 */
#define DP83848_CDCTRL1_CDPATTSEL_1_0_MASK (0x3U)
#define DP83848_CDCTRL1_CDPATTSEL_1_0_SHIFT (0U)
#define DP83848_CDCTRL1_CDPATTSEL_1_0_SET(x) (((uint16_t)(x) << DP83848_CDCTRL1_CDPATTSEL_1_0_SHIFT) & DP83848_CDCTRL1_CDPATTSEL_1_0_MASK)
#define DP83848_CDCTRL1_CDPATTSEL_1_0_GET(x) (((uint16_t)(x) & DP83848_CDCTRL1_CDPATTSEL_1_0_MASK) >> DP83848_CDCTRL1_CDPATTSEL_1_0_SHIFT)

/* Bitfield definition for register: EDCR */
/*
 * ED_EN (RW)
 *
 * Energy Detect Enable:
 * Allow Energy Detect Mode.
 * When Energy Detect is enabled and Auto-Negotiation is disabled through the BMCR
 * register, Auto-MDIX should be disabled through the PHYCR register.
 */
#define DP83848_EDCR_ED_EN_MASK (0x8000U)
#define DP83848_EDCR_ED_EN_SHIFT (15U)
#define DP83848_EDCR_ED_EN_SET(x) (((uint16_t)(x) << DP83848_EDCR_ED_EN_SHIFT) & DP83848_EDCR_ED_EN_MASK)
#define DP83848_EDCR_ED_EN_GET(x) (((uint16_t)(x) & DP83848_EDCR_ED_EN_MASK) >> DP83848_EDCR_ED_EN_SHIFT)

